[
    {
        "speaker": "Doctor",
        "start": 0.78,
        "end": 7.84,
        "text": "Hi, my name's Grace, I'm one of the medical students at the Sexual Health Clinic. Hello. Hi, could I just confirm your name and date of birth, please? Yeah,",
        "utterance_id": "U1"
    },
    {
        "speaker": "Patient",
        "start": 7.9,
        "end": 11.9,
        "text": "it's Holly Burton, it's the 19th of February, 2003. Lovely,",
        "utterance_id": "U2"
    },
    {
        "speaker": "Doctor",
        "start": 12.0,
        "end": 49.0,
        "text": "nice to meet you, Holly. Thank you. Before we start, I'm just going to chat to you a bit about what we do here at the Sexual Health Clinic. So, I want to let you know that everything we discuss today is confidential within the healthcare team. Unless you say something that makes me think that there's a risk to you or to other people, then I might have to break confidentiality, but I would always talk to you about that first. Does that make sense? Yeah. And the other thing is, because you're in a Sexual Health Clinic, I'm going to probably be asking about sexual partners and about genitals and about certain symptoms. Are there any words that you want me to use or not use that I can make things more comfortable for you? No, I'm fine. Okay. Thank you. Fine. So, Holly, how can I help you today?",
        "utterance_id": "U3"
    },
    {
        "speaker": "Patient",
        "start": 50.1,
        "end": 53.0,
        "text": "It's a bit embarrassing, but I think I might have an STI.",
        "utterance_id": "U4"
    },
    {
        "speaker": "Doctor",
        "start": 53.48,
        "end": 58.82,
        "text": "Okay, well, you're in the exact right place. Do you want to tell me a little bit more about your symptoms? Yeah,",
        "utterance_id": "U5"
    },
    {
        "speaker": "Patient",
        "start": 58.82,
        "end": 65.52,
        "text": "I've just been having, like, unusual discharge. And, yeah, I was going to say, I'm just a bit embarrassed by it all.",
        "utterance_id": "U6"
    },
    {
        "speaker": "Doctor",
        "start": 65.94,
        "end": 72.92,
        "text": "Okay. Well, don't be embarrassed. We see this all the time. We're here to help. You said your discharge is different to usual. In what way is it different?",
        "utterance_id": "U7"
    },
    {
        "speaker": "Patient",
        "start": 74.06,
        "end": 81.34,
        "text": "It's, like, kind of yellowish, a bit more watery than it usually is, and it doesn't smell very nice either.",
        "utterance_id": "U8"
    },
    {
        "speaker": "Doctor",
        "start": 81.72,
        "end": 90.4,
        "text": "Okay. And how long have you noticed that change for? Last week now. Yeah. Okay. And have you noticed any other symptoms? Yeah, I've had",
        "utterance_id": "U9"
    },
    {
        "speaker": "Patient",
        "start": 90.4,
        "end": 95.34,
        "text": "this, like, kind of burning sensation when I'm having a wee as well. Okay.",
        "utterance_id": "U10"
    },
    {
        "speaker": "Doctor",
        "start": 95.36,
        "end": 97.44,
        "text": "And are you going for a wee more often than usual?",
        "utterance_id": "U11"
    },
    {
        "speaker": "Patient",
        "start": 98.1,
        "end": 99.9,
        "text": "No, not more often. Just the normal amount.",
        "utterance_id": "U12"
    },
    {
        "speaker": "Doctor",
        "start": 100.2,
        "end": 143.6,
        "text": "So, just the burning? Yeah. Okay. Any other changes that you've noticed? No, that's it. Okay. I'm going to ask you a few different questions to make sure that we've not missed certain symptoms. So, I just want to check, are you feeling well in yourself? Yeah, I feel fine. No fevers at all? No. Okay. Have you had any symptoms from your bums or any discharge or pain from your bum? No. Okay. Have you noticed any pain in your tummy at all? No. Any itching or soreness over your vulva? No. Any lumps or bumps over your vulva? No. Have you noticed any unusual bleeding at all? No. Any bleeding after sex? No. Any pain when you're having sex? No. Okay. And do you have periods, Holly? I do, yeah. Tell me a bit about those. Yeah,",
        "utterance_id": "U13"
    },
    {
        "speaker": "Patient",
        "start": 143.7,
        "end": 147.84,
        "text": "they're regular. I take the combined pills, so I've no problems there.",
        "utterance_id": "U14"
    },
    {
        "speaker": "Doctor",
        "start": 148.1,
        "end": 173.14,
        "text": "Okay. And what was the first day of your last period? That was three weeks ago now. Okay. And have you missed any pills at all? Oh, no. I've got an alarm on my phone. I never forget. Perfect. Okay. So, Holly, to summarise then, you've come in because you've had a week of a change in your discharge. It's been yellowish, a bit malodorous, a bit more of it. And you've had some burning when you're weeing. Yeah? Yeah. You mentioned you were worried about an infection. Yeah. I",
        "utterance_id": "U15"
    },
    {
        "speaker": "Patient",
        "start": 173.14,
        "end": 179.62,
        "text": "met this guy a couple of times. A couple of weeks ago. And, yeah, I'm just thinking maybe I've caught something from him. Okay.",
        "utterance_id": "U16"
    },
    {
        "speaker": "Doctor",
        "start": 179.62,
        "end": 181.88,
        "text": "And was there anything specific that you're worried about?",
        "utterance_id": "U17"
    },
    {
        "speaker": "Patient",
        "start": 183.64,
        "end": 191.06,
        "text": "Initially, I'm thinking maybe chlamydia or something like that. But then I just worry if it's something a bit more serious or just hoping to get checked",
        "utterance_id": "U18"
    },
    {
        "speaker": "Doctor",
        "start": 191.06,
        "end": 197.46,
        "text": "over, really. Okay. And when you say worried about something more serious, do you have something in mind that you're concerned about? I'm",
        "utterance_id": "U19"
    },
    {
        "speaker": "Patient",
        "start": 197.46,
        "end": 202.54,
        "text": "not sure. I've never had anything like this before. So, yeah, I'm just wanting to get checked over, really.",
        "utterance_id": "U20"
    },
    {
        "speaker": "Doctor",
        "start": 202.8,
        "end": 214.22,
        "text": "Okay. Yeah. And we'll definitely, I'll ask you a few more questions. We'll do some tests today. Did you have anything specific in mind that you wanted to do at the clinic today, just so I know? Just what",
        "utterance_id": "U21"
    },
    {
        "speaker": "Patient",
        "start": 214.22,
        "end": 220.82,
        "text": "you said there. Just get, like, the kind of full tests or whatever and then have the treatment for whatever it is, I guess. Okay.",
        "utterance_id": "U22"
    },
    {
        "speaker": "Doctor",
        "start": 220.86,
        "end": 247.94,
        "text": "Perfect. That's really useful to know your perspective. Okay, Holly? Okay. So what I'm going to do now, Holly, is I'm going to ask you some questions about your recent sexual partners and sexual contact. The reason we do that is so I can do a risk assessment and so that we know what kind of tests. We need to be doing and where we need to be testing from. Okay. So do you want to let me know to begin with, when's the most recent time that you had sexual contact with anyone? That was 15 days ago now. Okay. And was that a one -off or was it with a regular partner? It's just a one -off at",
        "utterance_id": "U23"
    },
    {
        "speaker": "Patient",
        "start": 247.94,
        "end": 249.9,
        "text": "a party, yeah. Okay. And was",
        "utterance_id": "U24"
    },
    {
        "speaker": "Doctor",
        "start": 249.9,
        "end": 252.24,
        "text": "that a male contact or a female contact? A male,",
        "utterance_id": "U25"
    },
    {
        "speaker": "Patient",
        "start": 252.4,
        "end": 253.1,
        "text": "yeah. Okay.",
        "utterance_id": "U26"
    },
    {
        "speaker": "Doctor",
        "start": 253.12,
        "end": 349.8,
        "text": "And in terms of the type of sexual contact that you had, was that vaginal, oral or anal? Vaginal and oral. Okay. And the oral, was that giving or receiving or both? Both, yeah. Yeah. And did you use a condom with this person? No. And was this person born in the UK as far as you're aware? Yes, yeah. Okay. And we ask everybody this, but the contact that you've had, was that consensual? Oh yes, absolutely. Okay. Fine. So we're going to go back a bit more now. So when's the last time you had sexual contact with someone different? Before that was probably about two months ago. Okay. And was that a male or female partner? Male. And was that a one -off or was it a more regular thing? A couple of times, yeah. Yeah. And was that vaginal, oral, anal sex? Vaginal, just vaginal. And did you use a condom with this person? No. And were they born in the UK? Yes. Okay. And going back again, can you remember when you last had contact with someone different to that? Before that was about three months ago. Okay. And was that a male or female partner? Male. And was that a regular partner for a while or was it a one -off? Just a one -off at a time, yeah. Okay. And did you have vaginal, anal, oral sex or mixed? Vaginal. Vaginal. Vaginal. Vaginal. Vaginal. Vaginal. Did you use a condom with that person? No. And were they born in the UK? Yeah, as far as I know, yeah. Okay. And thinking over the last three months, do you know how many sexual partners you've had approximately? In the last three months? Three. Three? Yeah. And in the last 12 months? Five. Five. Okay. And those partners, have they all been male? Yeah. And were they all born in the UK? Yeah. Okay. And again, we ask everybody, but those contacts, have they been consensual? Yes. Yeah.",
        "utterance_id": "U27"
    },
    {
        "speaker": "Doctor",
        "start": 349.94,
        "end": 353.98,
        "text": "Okay. Holly, have you ever had an STI? Have you ever had a STI screen before? I",
        "utterance_id": "U28"
    },
    {
        "speaker": "Patient",
        "start": 353.98,
        "end": 359.66,
        "text": "did, yeah. I had one at uni about four months ago. Mm -hmm. Yeah, and that's all fine. Lovely.",
        "utterance_id": "U29"
    },
    {
        "speaker": "Doctor",
        "start": 359.78,
        "end": 362.72,
        "text": "And what type of tests did they do? Can you remember? Yeah,",
        "utterance_id": "U30"
    },
    {
        "speaker": "Patient",
        "start": 362.92,
        "end": 365.26,
        "text": "I had a, it was like a finger prick test and",
        "utterance_id": "U31"
    },
    {
        "speaker": "Doctor",
        "start": 365.26,
        "end": 383.44,
        "text": "a swab. Okay. And have you ever had an STI before? No. Okay, Holly, what I'm going to do now is ask you a few more questions. These are our risk assessment questions for different types of infections. Okay. You've talked about partners more recently, but have you ever had sexual contact with anyone who wasn't born in the UK? Yeah,",
        "utterance_id": "U32"
    },
    {
        "speaker": "Patient",
        "start": 383.56,
        "end": 389.14,
        "text": "about two years ago, I did meet a guy on holiday in Madrid, and yeah.",
        "utterance_id": "U33"
    },
    {
        "speaker": "Doctor",
        "start": 390.14,
        "end": 401.1,
        "text": "And were they born in Spain? Yes, he was born in Spain. Okay. Have you ever had sexual contact with a man who might have had sexual contact with other men? No. Do you have any tattoos? No.",
        "utterance_id": "U34"
    },
    {
        "speaker": "Doctor",
        "start": 401.62,
        "end": 471.6,
        "text": "Have you ever had sexual contact with anyone who you know to have syphilis or HIV or hepatitis? No. Have you ever injected drugs? No. No. No. Have you ever snorted drugs? No. No. Have you ever shared the drug snorting equipment, for example, a rolled up note? No. And have you ever had sexual contact with someone else who you suspect may have shared drug snorting equipment or who has injected drugs in the past? No. Okay. Have you ever paid for sex, Holly? No. Or been paid for sex? No. And as far as you're aware, have you been vaccinated against hepatitis B? I don't know, sorry. Yeah, no problem. So that's all my risk assessment questions, okay, Holly? Okay. Okay. Okay. Okay. Okay. Okay. Okay. So you've been to the sexual health clinic before and we don't have access to your records. I'm just going to ask a bit about your background. Do you have any other medical conditions? No. Okay. Do you have any gynecological problems that I should know about? No. Have you had any pregnancies before? No. You're too young for the smear test in the UK, but do you know if you've had the HPV vaccine? I did, yeah. I had that at school. Okay. And you mentioned that you take the combined pill. Do you take any other medications? No. Do you know what the name of your combined pill is? Yeah.",
        "utterance_id": "U35"
    },
    {
        "speaker": "Patient",
        "start": 471.62,
        "end": 474.22,
        "text": "It's Ringer -Weiden. Ringer -Weiden or something like that, yeah. Perfect.",
        "utterance_id": "U36"
    },
    {
        "speaker": "Doctor",
        "start": 474.5,
        "end": 484.22,
        "text": "And are you allergic to anything? No. Are there any medical conditions that run in the family that I should know about? No. Okay. And a bit about you then, Holly. What's your living situation? I",
        "utterance_id": "U37"
    },
    {
        "speaker": "Patient",
        "start": 484.22,
        "end": 487.54,
        "text": "live with a few friends at uni, like a kind of shared accommodation. Okay,",
        "utterance_id": "U38"
    },
    {
        "speaker": "Doctor",
        "start": 487.64,
        "end": 493.64,
        "text": "lovely. What are you studying? History. History. Okay. And Holly, do you smoke at all? Very",
        "utterance_id": "U39"
    },
    {
        "speaker": "Patient",
        "start": 493.64,
        "end": 496.98,
        "text": "occasionally when I'm out I'll have the odd tab, but no, not really. Okay.",
        "utterance_id": "U40"
    },
    {
        "speaker": "Doctor",
        "start": 497.02,
        "end": 501.18,
        "text": "And how much alcohol do you usually drink in the average week? I tend",
        "utterance_id": "U41"
    },
    {
        "speaker": "Patient",
        "start": 501.18,
        "end": 509.5,
        "text": "to go out about three times a week. I like a vodka and coke. I usually double vodka and coke, so maybe, yeah, five of",
        "utterance_id": "U42"
    },
    {
        "speaker": "Doctor",
        "start": 509.5,
        "end": 523.88,
        "text": "those a night. Okay. So five doubles about three times a week. Is that right? Yeah, that's right. Yeah. Okay. And do you use drugs at all, Holly? I've done a bit of coke occasionally. Yeah. And how often would you use coke? Not very",
        "utterance_id": "U43"
    },
    {
        "speaker": "Patient",
        "start": 523.88,
        "end": 527.54,
        "text": "often. The last time was like about four months ago, so maybe once or twice",
        "utterance_id": "U44"
    },
    {
        "speaker": "Doctor",
        "start": 527.54,
        "end": 594.44,
        "text": "a year. Okay. And how do you take the cocaine? Just off my house key. Okay. And have you ever shared drug snorting equipment with other people? No. Have you ever injected drugs? No. Are there any other drugs that you use? No, that's it. Okay. So Holly, I think that's all my questions for today. I'm just going to summarise back to you to make sure that we've not missed anything. Okay. So you've come to the sexual health clinic today because you're worried that you may have picked up a sexually transmitted infection. You have symptoms of a change of discharge over the last week where your discharge is more watery, it's more yellowish and it smells different. Okay. Okay. You've also got a bit of burning when you're peeing. Yeah. We've talked about your most recent sexual partners and I've asked you a few questions in a risk assessment. You're a student, you live with your friends, you drink about 30 units of alcohol a week and you very occasionally snort cocaine from your own key that you've not shared. Is that right? Yeah, that's right. Okay. And your main worry today is that you have this infection, you want full testing. Yes, please. Yeah. Okay. Is there anything you feel that I've missed there? No, I think that's everything. Okay. And do you have any questions for me? No. Fine. Okay. In that case, Holly, that's all my questions. Thank you. Thank you.",
        "utterance_id": "U45"
    }
]